Catalogs/Контрагенты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.15">
	<Catalog>
		<Properties>
			<Name>Контрагенты</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Тип</Name>
					<Comment>ЮЛ - юридическое лицо, ФЛ- физ.лицо не ИП, ИП- физлицо ИП</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>8</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИНН</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КПП</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>9</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументУдостоверяющийЛичность</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>256</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>КлючиВИсточникахДанных</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Период</Name>
							<Comment>Момент времени установки ГУИД</Comment>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипДанных</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ИБ_ТипыДанных</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипКлюча</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ИБ_ТипыДанных</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеКлюча</Name>
							<Comment>Идентификатор (ГУИД для справочника) в источнике данных</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>36</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИсточникДанных</Name>
							<Comment>Вспопомогательный, используется  если не заполнен ТипДанных, совместно с ТипДанныXML</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.ИБ_ИсточникиДанных</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипДанныхXML</Name>
							<Comment>Вспопомогательный, используется  если не заполнен ТипДанных, совместно с ИсточникиДанных</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>128</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПредставлениеКлюча</Name>
							<Comment>Представление в источнике данных</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>128</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДопПредставлениеКлюча</Name>
							<Comment>Для справочника - код, для перечисления - порядковый номер значения</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>128</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Взаимосвязи</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Контрагент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипВзаимосвязи</Name>
							<Comment>ОП - обособленное подразделение, ГО - головная организация</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>8</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ИсторияРеквизитов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Период</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИмяРеквизита</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>32</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>256</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КодСтроки</Name>
							<Comment>Внешний ключ для связи с табличной частью КонтактнаяИнформация</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>36</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Комментарий</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>32</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>КонтактнаяИнформация</Name>
					<Comment>Каналы коммуникаций с контрагентом</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>64</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КодСтроки</Name>
							<Comment>Код строки как первичный ключ</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>36</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/Контрагенты/Ext/ManagerModule.bsl
Функция  ПолучиТаблицуИдентификаторовПоРеквизиту(ТипДанных, ИмяРеквизита="Код", ЗначениеРеквизита) экспорт
	// Заполняет основное поле строки поля ГУИД, а также вспомогательный поля Период, ИсточникДанных, ТипДанныхXML, перезаполняет поле Представление
	
	Результат = Новый ТаблицаЗначений();
	ЗначениеПоУмолчанию = Результат;
		
	Доступно = 	ТипЗнч(ТипДанных) = Тип("СправочникСсылка.ИБ_ТипыДанных")
				И ЗначениеЗаполнено(ТипДанных)
				И ЗначениеЗаполнено(ТипДанных.ИсточникДанных.ПараметрыСоединения)
				И ТипЗнч(ИмяРеквизита) = Тип("Строка")
				И ЗначениеЗаполнено(ИмяРеквизита)
				И ТипЗнч(ЗначениеРеквизита) = Тип("Строка")
				И ЗначениеЗаполнено(ЗначениеРеквизита);
	Если Не Доступно Тогда
		ЗаписьЖурналаРегистрации("ЗаполниитьИсточникДанныхПоРеквизиту", УровеньЖурналаРегистрации.Ошибка, "ТипДанных = "+ТипДанных+"; ИмяРеквизита = "+ИмяРеквизита+"; ЗначениеРеквизита = "+ЗначениеРеквизита, "Ошибка в типе или заполнении аргументов");
		Возврат ЗначениеПоУмолчанию;
	КонецЕсли;
	
	БИ = ОбщегоНазначения.ПолучитьПодключениеБД(ТипДанных.ИсточникДанных.ПараметрыСоединения);
	БИ_Запрос =  БИ.NewObject("Запрос");
	ТекстЗапроса =  "ВЫБРАТЬ	ПРЕДСТАВЛЕНИЕ(УНИКАЛЬНЫЙИДЕНТИФИКАТОР(Т.Ссылка)) КАК Ссылка, Т.Код КАК Код, Т.Наименование КАК Наименование
	                |ИЗ			Справочник.Контрагенты КАК Т
	                |ГДЕ		Т.Код = &ЗначениеРеквизита";
	ТекстЗапроса = ?(ВРЕГ(СокрЛП(ИмяРеквизита))<> "КОД",  СтрЗаменить(ТекстЗапроса, "Код", СокрЛП(ИмяРеквизита)), ТекстЗапроса);   
	БИ_Запрос.Текст = ТекстЗапроса;
	БИ_Запрос.УстановитьПараметр("ЗначениеРеквизита", ЗначениеРеквизита);	
	Попытка
		БИ_РезультатЗапроса = БИ_Запрос.Выполнить();
	Исключение
		ЗаписьЖурналаРегистрации("ЗаполниитьИсточникДанныхПоРеквизиту", УровеньЖурналаРегистрации.Ошибка, "ТекстЗапроса="+ТекстЗапроса, "Ошибка выполнения запроса в базе-источнике:"+ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
	КонецПопытки;
	
	ОписТипаСтрока = Новый ОписаниеТипов("Строка");
	
	Результат.Колонки.Добавить("Идентификатор", 	ОписТипаСтрока);
	Результат.Колонки.Добавить("Код", 				ОписТипаСтрока);
	Результат.Колонки.Добавить("Наименование",	 	ОписТипаСтрока);
	Результат.Колонки.Добавить("ТипДанныхXML",	 	ОписТипаСтрока);
		
	БИ_Выборка = БИ_РезультатЗапроса.Выбрать();
	Пока БИ_Выборка.Следующий() Цикл
		НоваяСтрока = Результат.Добавить();
		
		ТипДанныхXML = БИ.СериализаторXDTO.XMLТипЗнч(БИ_Выборка.Ссылка);	
		Если ТипДанныхXML <> Неопределено Тогда
			НоваяСтрока.ТипДанныхXML	= ТипДанныхXML.URIПространстваИмен+":"+ТипДанныхXML.ИмяТипа;
		КонецЕсли;

		НоваяСтрока.Идентификатор	=	БИ_Выборка.Ссылка;
		НоваяСтрока.Код				=	БИ_Выборка.Код;
		НоваяСтрока.Наименование	=	БИ_Выборка.Наименование;
	КонецЦикла;
	
	Возврат Результат
КонецФункции

Функция НайдиПоКонтактнымДанным(КонтактныеДанные) Экспорт
	//Возвращает ссылку на контрагента по параметру КонтактныеДанные - номер телефона, адред эл.почты и прочие
	
	Доступно = ТипЗнч(КонтактныеДанные) = Тип("Строка") И СтрДлина(КонтактныеДанные)>4;	
	Если Не Доступно Тогда
		Возврат Справочники.Контрагенты.ПустаяСсылка();
	КонецЕсли;
	
	Запрос = Новый Запрос("ВЫБРАТЬ Первые 1 Ссылка ИЗ Справочник.Контрагенты ГДЕ КонтактнаяИнформация.Значение = &Значение");
	Запрос.УстановитьПараметр("Значение", КонтактныеДанные);
	РЗ = Запрос.Выполнить();	
	Рез = ?(РЗ.Пустой(), Справочники.Контрагенты.ПустаяСсылка(), РЗ.Выгрузить()[0][0]);
	Возврат Рез;
КонецФункции
